# 1. DATAFRAME CONCATENATION

In [ ]:
import pandas as pd

In [ ]:
# Creating a dataframe from a dictionary
# Let's define a dataframe with a list of bank clients with IDs = 1, 2, 3, 4, 5 
# Check this out: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

raw_data = {'Bank Client ID': ['1', '2', '3', '4', '5'],
            'First Name': ['Nancy', 'Alex', 'Shep', 'Max', 'Allen'], 
            'Last Name': ['Rob', 'Ali', 'George', 'Mitch', 'Steve']}

bank1_df = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
bank1_df

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve

In [ ]:
# Let's define another dataframe for a separate list of clients (IDs = 6, 7, 8, 9, 10)
raw_data = {
        'Bank Client ID': ['6', '7', '8', '9', '10'],
        'First Name': ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'], 
        'Last Name': ['Christian', 'Mo', 'Steve', 'Bob', 'Michelle']}
bank2_df = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
bank2_df

  Bank Client ID First Name  Last Name
0              6       Bill  Christian
1              7       Dina         Mo
2              8      Sarah      Steve
3              9    Heather        Bob
4             10      Holly   Michelle

In [ ]:
# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10
# Note that by default ignore_index has been set to False meaning indexes from both dataframes are kept unchanged
bank_all_df = pd.concat([bank1_df, bank2_df])
bank_all_df

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
0              6       Bill  Christian
1              7       Dina         Mo
2              8      Sarah      Steve
3              9    Heather        Bob
4             10      Holly   Michelle

In [ ]:
# Let's concatenate both dataframes #1 and #2
# Note that by setting ignore_index = True, the index has been automatically set to numeric and now ranges from 1 to 9
bank_all_df = pd.concat([bank1_df, bank2_df], ignore_index = True)
bank_all_df

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
5              6       Bill  Christian
6              7       Dina         Mo
7              8      Sarah      Steve
8              9    Heather        Bob
9             10      Holly   Michelle

In [ ]:
len(bank_all_df)

10

In [ ]:
# You can also use the append method to perform similar task
# Note that order matters!
bank_all_df = bank2_df.append(bank1_df, ignore_index = True)
bank_all_df

  Bank Client ID First Name  Last Name
0              6       Bill  Christian
1              7       Dina         Mo
2              8      Sarah      Steve
3              9    Heather        Bob
4             10      Holly   Michelle
5              1      Nancy        Rob
6              2       Alex        Ali
7              3       Shep     George
8              4        Max      Mitch
9              5      Allen      Steve

In [ ]:
# You can also use the append method to perform similar task 
bank_all_df = bank1_df.append(bank2_df, ignore_index = True)
bank_all_df

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
5              6       Bill  Christian
6              7       Dina         Mo
7              8      Sarah      Steve
8              9    Heather        Bob
9             10      Holly   Michelle

**MINI CHALLENGE #1:**
- **Assume that you and your significant other become a new client at the bank and would like to add your first names, last names and unique client IDs. Define a new DataFrame and add it to the master list "bank_all_df"**

# 2. DATAFRAME CONCATENATION WITH MULTI-INDEXING

In [ ]:
# We can perform concatenation and also use multi-indexing dataframe as follows:
bank_all_df = pd.concat([bank1_df, bank2_df], keys = ["Customers Group 1", "Customers Group 2"])
bank_all_df

                    Bank Client ID First Name  Last Name
Customers Group 1 0              1      Nancy        Rob
                  1              2       Alex        Ali
                  2              3       Shep     George
                  3              4        Max      Mitch
                  4              5      Allen      Steve
Customers Group 2 0              6       Bill  Christian
                  1              7       Dina         Mo
                  2              8      Sarah      Steve
                  3              9    Heather        Bob
                  4             10      Holly   Michelle

In [ ]:
# You can access elements using multi-indexing as follows
bank_all_df.loc[("Customers Group 1"), 0]

Bank Client ID        1
First Name        Nancy
Last Name           Rob
Name: (Customers Group 1, 0), dtype: object

In [ ]:
# You can access elements using multi-indexing as follows
bank_all_df.loc[("Customers Group 2"), 'First Name']

0       Bill
1       Dina
2      Sarah
3    Heather
4      Holly
Name: First Name, dtype: object

In [ ]:
# You can access elements using multi-indexing as follows
bank_all_df.loc[("Customers Group 1"), :]

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve

**MINI CHALLENGE #2:**
- **Assume that you and your significant other belong to Customers Group #3. Use multindexing to add both names to the master list. Write a line of code to access Group #3 only.**

# 3. DATA MERGING

In [ ]:
# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10
# Note that by default ignore_index has been set to False meaning indexes from both dataframes are kept unchanged
bank_all_df = pd.concat([bank1_df, bank2_df], ignore_index = True)
bank_all_df

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
5              6       Bill  Christian
6              7       Dina         Mo
7              8      Sarah      Steve
8              9    Heather        Bob
9             10      Holly   Michelle

In [ ]:
# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10
 
raw_data = {
        'Bank Client ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
        'Annual Salary [$/year]': [25000, 35000, 45000, 48000, 49000, 32000, 33000, 34000, 23000, 22000]}
bank_salary_df = pd.DataFrame(raw_data, columns = ['Bank Client ID','Annual Salary [$/year]'])
bank_salary_df

  Bank Client ID  Annual Salary [$/year]
0              1                   25000
1              2                   35000
2              3                   45000
3              4                   48000
4              5                   49000
5              6                   32000
6              7                   33000
7              8                   34000
8              9                   23000
9             10                   22000

In [ ]:
# Let's merge all data on 'Bank Client ID'
bank_all_df = pd.merge(bank_all_df, bank_salary_df, on = 'Bank Client ID')
bank_all_df

  Bank Client ID First Name  Last Name  Annual Salary [$/year]
0              1      Nancy        Rob                   25000
1              2       Alex        Ali                   35000
2              3       Shep     George                   45000
3              4        Max      Mitch                   48000
4              5      Allen      Steve                   49000
5              6       Bill  Christian                   32000
6              7       Dina         Mo                   33000
7              8      Sarah      Steve                   34000
8              9    Heather        Bob                   23000
9             10      Holly   Michelle                   22000

In [ ]:
bank_all_df

  Bank Client ID First Name  Last Name  Annual Salary [$/year]
0              1      Nancy        Rob                   25000
1              2       Alex        Ali                   35000
2              3       Shep     George                   45000
3              4        Max      Mitch                   48000
4              5      Allen      Steve                   49000
5              6       Bill  Christian                   32000
6              7       Dina         Mo                   33000
7              8      Sarah      Steve                   34000
8              9    Heather        Bob                   23000
9             10      Holly   Michelle                   22000

**MINI CHALLENGE #3:**
- **Let's assume that you were able to obtain two new pieces of information about the bank clients such as: (1) credit card debt, (2) age**
- **Define a new DataFrame that contains this new information**
- **Merge this new information to the DataFrame "bank_all_df".**

# MINI CHALLENGES SOLUTIONS

**MINI CHALLENGE #1 SOLUTION:**
- **Assume that you and your significant other become a new client at the bank and would like to add your first names, last names and unique client IDs. Define a new DataFrame and add it to the master list "bank_all_df"**

In [ ]:
new_data = {'Bank Client ID': ['11', '12'],
            'First Name': ['Justin', 'Sophie'], 
            'Last Name': ['Trudeau', 'Trudeau']}

bank3_df = pd.DataFrame(new_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
bank3_df

  Bank Client ID First Name Last Name
0             11     Justin   Trudeau
1             12     Sophie   Trudeau

In [ ]:
# Let's concatenate both dataframes #1 and #2
# Note that by setting ignore_index = True, the index has been automatically set to numeric and now ranges from 1 to 9
bank_all_df = pd.concat([bank_all_df, bank3_df], ignore_index = True)
bank_all_df

   Bank Client ID First Name  Last Name  Annual Salary [$/year]
0               1      Nancy        Rob                 25000.0
1               2       Alex        Ali                 35000.0
2               3       Shep     George                 45000.0
3               4        Max      Mitch                 48000.0
4               5      Allen      Steve                 49000.0
5               6       Bill  Christian                 32000.0
6               7       Dina         Mo                 33000.0
7               8      Sarah      Steve                 34000.0
8               9    Heather        Bob                 23000.0
9              10      Holly   Michelle                 22000.0
10             11     Justin    Trudeau                     NaN
11             12     Sophie    Trudeau                     NaN

**MINI CHALLENGE #2 SOLUTION:**
- **Assume that you and your significant other belong to Customers Group #3. Use multindexing to add both names to the master list. Write a line of code to access Group #3 only.**

In [ ]:
bank1_df

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve

In [ ]:
bank2_df

  Bank Client ID First Name  Last Name
0              6       Bill  Christian
1              7       Dina         Mo
2              8      Sarah      Steve
3              9    Heather        Bob
4             10      Holly   Michelle

In [ ]:
new_data = {'Bank Client ID': ['11', '12'],
            'First Name': ['Justin', 'Sophie'], 
            'Last Name': ['Trudeau', 'Trudeau']}

bank3_df = pd.DataFrame(new_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
bank3_df

  Bank Client ID First Name Last Name
0             11     Justin   Trudeau
1             12     Sophie   Trudeau

In [ ]:
# We can perform concatenation and also use multi-indexing dataframe as follows:
bank_all_df = pd.concat([bank1_df, bank2_df, bank3_df], keys = ["Customers Group 1", "Customers Group 2",  "Customers Group 3"])
bank_all_df

                    Bank Client ID First Name  Last Name
Customers Group 1 0              1      Nancy        Rob
                  1              2       Alex        Ali
                  2              3       Shep     George
                  3              4        Max      Mitch
                  4              5      Allen      Steve
Customers Group 2 0              6       Bill  Christian
                  1              7       Dina         Mo
                  2              8      Sarah      Steve
                  3              9    Heather        Bob
                  4             10      Holly   Michelle
Customers Group 3 0             11     Justin    Trudeau
                  1             12     Sophie    Trudeau

In [ ]:
# You can access elements using multi-indexing as follows
bank_all_df.loc[("Customers Group 3"), :]

  Bank Client ID First Name Last Name
0             11     Justin   Trudeau
1             12     Sophie   Trudeau

**MINI CHALLENGE #3 SOLUTION:**
- **Let's assume that you were able to obtain two new pieces of information about the bank clients such as: (1) credit card debt, (2) age**
- **Define a new DataFrame that contains this new information**
- **Merge this new information to the DataFrame "bank_all_df".**

In [ ]:
# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10
 
raw_data = {
        'Bank Client ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
        'Credit Card Debt': [1000, 100, 500, 600, 0, 20, 360, 127, 3000, 2200],
        'Age': [44, 35, 67, 19, 22, 45, 48, 33, 34, 36]}
bank_credit_age_df = pd.DataFrame(raw_data, columns = ['Bank Client ID','Credit Card Debt', 'Age'])
bank_credit_age_df

  Bank Client ID  Credit Card Debt  Age
0              1              1000   44
1              2               100   35
2              3               500   67
3              4               600   19
4              5                 0   22
5              6                20   45
6              7               360   48
7              8               127   33
8              9              3000   34
9             10              2200   36

In [ ]:
# Let's merge all data on 'Bank Client ID'
bank_all_df = pd.merge(bank_all_df, bank_credit_age_df, on = 'Bank Client ID')
bank_all_df

  Bank Client ID First Name  Last Name  Credit Card Debt  Age
0              1      Nancy        Rob              1000   44
1              2       Alex        Ali               100   35
2              3       Shep     George               500   67
3              4        Max      Mitch               600   19
4              5      Allen      Steve                 0   22
5              6       Bill  Christian                20   45
6              7       Dina         Mo               360   48
7              8      Sarah      Steve               127   33
8              9    Heather        Bob              3000   34
9             10      Holly   Michelle              2200   36